{"modelTopology": {"backend": "tensorflow", "keras_version": "2.2.2", "model_config": {"config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 256, 256, 3]}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 32, "data_format": "channels_last", "kernel_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "bias_regularizer": null}, "name": "conv2d_1"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_1"}, "name": "leaky_re_lu_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "bias_regularizer": null}, "name": "conv2d_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_1", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_1"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_2"}, "name": "leaky_re_lu_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 128, "data_format": "channels_last", "kernel_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "bias_regularizer": null}, "name": "conv2d_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_2", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_2"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_3"}, "name": "leaky_re_lu_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "kernel_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_regularizer": null, "name": "conv2d_4", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "bias_regularizer": null}, "name": "conv2d_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_3", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_3"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_4"}, "name": "leaky_re_lu_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "kernel_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_regularizer": null, "name": "conv2d_5", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "bias_regularizer": null}, "name": "conv2d_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_4", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_4"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_5"}, "name": "leaky_re_lu_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "kernel_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_regularizer": null, "name": "conv2d_6", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "bias_regularizer": null}, "name": "conv2d_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_5", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_5"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_6"}, "name": "leaky_re_lu_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "kernel_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_regularizer": null, "name": "conv2d_7", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "bias_regularizer": null}, "name": "conv2d_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_6", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_6"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_7"}, "name": "leaky_re_lu_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "kernel_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_regularizer": null, "name": "conv2d_8", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "bias_regularizer": null}, "name": "conv2d_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_7", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_7"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"activation": "linear", "output_padding": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_transpose_1", "kernel_size": [4, 4], "padding": "same", "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "name": "conv2d_transpose_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_8", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_8"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_1", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "name": "concatenate_1"}, "name": "concatenate_1"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"activation": "linear", "output_padding": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_transpose_2", "kernel_size": [4, 4], "padding": "same", "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "name": "conv2d_transpose_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_9", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_9"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_2", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "name": "concatenate_2"}, "name": "concatenate_2"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"activation": "linear", "output_padding": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_transpose_3", "kernel_size": [4, 4], "padding": "same", "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "name": "conv2d_transpose_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_10", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_10"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_3"}, "name": "dropout_3"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_3", 0, 0, {}], ["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "name": "concatenate_3"}, "name": "concatenate_3"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"activation": "linear", "output_padding": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 256, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_transpose_4", "kernel_size": [4, 4], "padding": "same", "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "name": "conv2d_transpose_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_11", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_11"}, {"class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "name": "concatenate_4"}, "name": "concatenate_4"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"activation": "linear", "output_padding": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 128, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_transpose_5", "kernel_size": [4, 4], "padding": "same", "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "name": "conv2d_transpose_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_5", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_12", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_12"}, {"class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "name": "concatenate_5"}, "name": "concatenate_5"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"activation": "linear", "output_padding": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_transpose_6", "kernel_size": [4, 4], "padding": "same", "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "name": "conv2d_transpose_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_6", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_13", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_13"}, {"class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "name": "concatenate_6"}, "name": "concatenate_6"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"activation": "linear", "output_padding": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_transpose_7", "kernel_size": [4, 4], "padding": "same", "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "name": "conv2d_transpose_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_7", 0, 0, {"training": 1}]]], "config": {"gamma_constraint": null, "beta_regularizer": null, "axis": 3, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "name": "batch_normalization_14", "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_14"}, {"class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}], ["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "name": "concatenate_7"}, "name": "concatenate_7"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_7", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "name": "activation_8"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"activation": "linear", "output_padding": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "filters": 3, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_transpose_8", "kernel_size": [4, 4], "padding": "same", "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "name": "conv2d_transpose_8"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_transpose_8", 0, 0, {}]]], "config": {"activation": "tanh", "trainable": true, "name": "activation_9"}, "name": "activation_9"}], "output_layers": [["activation_9", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of13", "group1-shard2of13", "group1-shard3of13", "group1-shard4of13", "group1-shard5of13", "group1-shard6of13", "group1-shard7of13", "group1-shard8of13", "group1-shard9of13", "group1-shard10of13", "group1-shard11of13", "group1-shard12of13", "group1-shard13of13"], "weights": [{"dtype": "float32", "name": "batch_normalization_1/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_1/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_1/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_1/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_10/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_10/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_10/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_10/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_11/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_11/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_11/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_11/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_12/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_12/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_12/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_12/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_13/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_13/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_13/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_13/moving_variance", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_14/gamma", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_14/beta", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_14/moving_mean", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_14/moving_variance", "shape": [32]}, {"dtype": "float32", "name": "batch_normalization_2/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_2/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_2/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_2/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_3/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_3/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_3/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_3/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_4/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_4/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_4/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_4/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_5/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_5/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_5/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_5/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_6/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_6/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_6/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_6/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_7/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_7/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_7/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_7/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_8/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_8/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_8/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_8/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_9/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_9/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_9/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_9/moving_variance", "shape": [256]}, {"dtype": "float32", "name": "conv2d_1/kernel", "shape": [4, 4, 3, 32]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_2/kernel", "shape": [4, 4, 32, 64]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_3/kernel", "shape": [4, 4, 64, 128]}, {"dtype": "float32", "name": "conv2d_3/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_4/kernel", "shape": [4, 4, 128, 256]}, {"dtype": "float32", "name": "conv2d_4/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_5/kernel", "shape": [4, 4, 256, 256]}, {"dtype": "float32", "name": "conv2d_5/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_6/kernel", "shape": [4, 4, 256, 256]}, {"dtype": "float32", "name": "conv2d_6/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_7/kernel", "shape": [4, 4, 256, 256]}, {"dtype": "float32", "name": "conv2d_7/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_8/kernel", "shape": [4, 4, 256, 256]}, {"dtype": "float32", "name": "conv2d_8/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_transpose_1/kernel", "shape": [4, 4, 256, 256]}, {"dtype": "float32", "name": "conv2d_transpose_1/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_transpose_2/kernel", "shape": [4, 4, 256, 512]}, {"dtype": "float32", "name": "conv2d_transpose_2/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_transpose_3/kernel", "shape": [4, 4, 256, 512]}, {"dtype": "float32", "name": "conv2d_transpose_3/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_transpose_4/kernel", "shape": [4, 4, 256, 512]}, {"dtype": "float32", "name": "conv2d_transpose_4/bias", "shape": [256]}, {"dtype": "float32", "name": "conv2d_transpose_5/kernel", "shape": [4, 4, 128, 512]}, {"dtype": "float32", "name": "conv2d_transpose_5/bias", "shape": [128]}, {"dtype": "float32", "name": "conv2d_transpose_6/kernel", "shape": [4, 4, 64, 256]}, {"dtype": "float32", "name": "conv2d_transpose_6/bias", "shape": [64]}, {"dtype": "float32", "name": "conv2d_transpose_7/kernel", "shape": [4, 4, 32, 128]}, {"dtype": "float32", "name": "conv2d_transpose_7/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_transpose_8/kernel", "shape": [4, 4, 3, 64]}, {"dtype": "float32", "name": "conv2d_transpose_8/bias", "shape": [3]}]}]}