{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"output_layers": [["activation_9", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 256, 256, 3], "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"activation": "linear", "kernel_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "name": "conv2d_1", "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_1", "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"activation": "linear", "kernel_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "name": "conv2d_2", "filters": 64, "kernel_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_2", 0, 0, {"training": 1}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_2", "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_2"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"activation": "linear", "kernel_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "name": "conv2d_3", "filters": 128, "kernel_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_3", 0, 0, {"training": 1}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_3", "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_3"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"activation": "linear", "kernel_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "name": "conv2d_4", "filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_4", 0, 0, {"training": 1}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_4", "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_4"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"activation": "linear", "kernel_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "name": "conv2d_5", "filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_5", 0, 0, {"training": 1}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_5", "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_5"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"activation": "linear", "kernel_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "name": "conv2d_6", "filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_6", 0, 0, {"training": 1}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_6", "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_6"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"activation": "linear", "kernel_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "name": "conv2d_7", "filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_7", 0, 0, {"training": 1}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_7", "config": {"trainable": true, "alpha": 0.20000000298023224, "name": "leaky_re_lu_7"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"activation": "linear", "kernel_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "name": "conv2d_8", "filters": 256, "kernel_constraint": null, "dilation_rate": [1, 1]}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_8", 0, 0, {"training": 1}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 256, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "activation": "linear", "name": "conv2d_transpose_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "output_padding": null, "kernel_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {"training": 1}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "noise_shape": null, "rate": 0.5, "seed": null, "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": true, "axis": 3, "name": "concatenate_1"}, "inbound_nodes": [[["dropout_1", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 256, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "activation": "linear", "name": "conv2d_transpose_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "output_padding": null, "kernel_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {"training": 1}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"name": "dropout_2", "noise_shape": null, "rate": 0.5, "seed": null, "trainable": true}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_2", "config": {"trainable": true, "axis": 3, "name": "concatenate_2"}, "inbound_nodes": [[["dropout_2", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 256, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "activation": "linear", "name": "conv2d_transpose_3", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "output_padding": null, "kernel_constraint": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {"training": 1}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"name": "dropout_3", "noise_shape": null, "rate": 0.5, "seed": null, "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_3", "config": {"trainable": true, "axis": 3, "name": "concatenate_3"}, "inbound_nodes": [[["dropout_3", 0, 0, {}], ["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 256, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "activation": "linear", "name": "conv2d_transpose_4", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "output_padding": null, "kernel_constraint": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {"training": 1}]]]}, {"class_name": "Concatenate", "name": "concatenate_4", "config": {"trainable": true, "axis": 3, "name": "concatenate_4"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 128, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "activation": "linear", "name": "conv2d_transpose_5", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "output_padding": null, "kernel_constraint": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_transpose_5", 0, 0, {"training": 1}]]]}, {"class_name": "Concatenate", "name": "concatenate_5", "config": {"trainable": true, "axis": 3, "name": "concatenate_5"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_6", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "activation": "linear", "name": "conv2d_transpose_6", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "output_padding": null, "kernel_constraint": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_transpose_6", 0, 0, {"training": 1}]]]}, {"class_name": "Concatenate", "name": "concatenate_6", "config": {"trainable": true, "axis": 3, "name": "concatenate_6"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_7", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 32, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "activation": "linear", "name": "conv2d_transpose_7", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "output_padding": null, "kernel_constraint": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": 3, "gamma_regularizer": null, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_transpose_7", 0, 0, {"training": 1}]]]}, {"class_name": "Concatenate", "name": "concatenate_7", "config": {"trainable": true, "axis": 3, "name": "concatenate_7"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}], ["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"name": "activation_8", "activation": "relu", "trainable": true}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_8", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 3, "kernel_regularizer": null, "padding": "same", "strides": [2, 2], "activation": "linear", "name": "conv2d_transpose_8", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [4, 4], "output_padding": null, "kernel_constraint": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"name": "activation_9", "activation": "tanh", "trainable": true}, "inbound_nodes": [[["conv2d_transpose_8", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}}}, "weightsManifest": [{"paths": ["group1-shard1of13", "group1-shard2of13", "group1-shard3of13", "group1-shard4of13", "group1-shard5of13", "group1-shard6of13", "group1-shard7of13", "group1-shard8of13", "group1-shard9of13", "group1-shard10of13", "group1-shard11of13", "group1-shard12of13", "group1-shard13of13"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_10/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_12/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_13/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_14/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [4, 4, 3, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [4, 4, 32, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_4/kernel", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "conv2d_transpose_4/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_5/kernel", "shape": [4, 4, 128, 512], "dtype": "float32"}, {"name": "conv2d_transpose_5/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_6/kernel", "shape": [4, 4, 64, 256], "dtype": "float32"}, {"name": "conv2d_transpose_6/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_7/kernel", "shape": [4, 4, 32, 128], "dtype": "float32"}, {"name": "conv2d_transpose_7/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_transpose_8/kernel", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "conv2d_transpose_8/bias", "shape": [3], "dtype": "float32"}]}]}